pet_store/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."species" = ?  [["species", "cats"]]
---
    def index
        @pets = nil
        @header_name = params[:species].capitalize
        temp_species = @header_name[0...-1]

        if temp_species == "Pet"
            @pets = Pet.all
        else
            @pets = Pet.where(species: temp_species)