pet_store/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        id = params[:id]
        @pet = Pet.find(id)

SELECT "pets".* FROM "pets" WHERE "pets"."species" = ?  [["species", "Octop"]]
---
    def by_species
        temp_species = params[:species]
        @all_of_species = Pet.where("species = #{temp_species}")